import React from "react";

const PetFoodInfo = () => {
  return (
    <div className="bg-white p-5 rounded-lg shadow w-[95%] lg:w-[900px] mt-4 mx-auto">
      <div className="flex flex-col">
        {/* เนื้อหาเกี่ยวกับอาหาร */}
        <div className="text-[#6373B7]">
          <p className="text-lg mt-2">
          ลักษณะอาหาร : ควรให้ความสำคัญกับสูตรโภชนาการที่เหมาะสมกับวัยของแมวอาหารแมวสำเร็จรูปสูตรสุขภาพ
(cat food) ที่มีสัดส่วนโปรตีน วิตามิน และแร่ธาตุที่ครบถ้วน         โดยควรเลือกชนิดที่มีคุณภาพดีและมีความสดใหม่ 
เช่น อาหารกระป๋องหรืออาหารในถุงบรรจุ นอกจากนี้ การให้อาหารแห้งและอาหารเปียกสลับกัน จะช่วยกระตุ้นน้ำลายและการดื่มน้ำของแมว 
    ซึ่งเป็นเรื่องสำคัญเนื่องจากแมวสูงวัยมักจะดื่มน้ำน้อยลง ควรแบ่งมื้ออาหารเป็น 2-3 มื้อต่อวัน เนื่องจากแมวสูงอายุจะมีความต้องการอาหารที่ลดลง แต่ต้องได้รับอย่างสม่ำเสมอ นอกจากนี้ การเสริมอาหารพิเศษตามคำแนะนำของสัตวแพทย์ เช่น อาหารเสริมสำหรับขนและข้อ ก็อาจเป็นประโยชน์ต่อสุขภาพของแมวอายุ 7 ปี 
          </p>
          <p className="text-lg mt-4">
            โดยการแบ่งมื้ออาหารเป็น 2-3 มื้อ และควรให้การออกกำลังกายเหมาะสมเพื่อลดน้ำหนักตัวในช่วงวัยนี้
          </p>
        </div>
      </div>
    </div>
  );
};

export default PetFoodInfo;
